cf/Catalogs/НастройкиPostman.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиPostman</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтчетыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеудач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОчетыСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/НастройкиPostman/Forms/ФормаГруппы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальноеЗаполнение();
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнение()
	РРЗ = ПолучитьРасписаниеРегламентногоЗадания(Объект.Расписание);
	Объект.РасписаниеПредставление = Строка(?(РРЗ = Неопределено,"",РРЗ));
	
	Объект.ФорматФайла = ?(Объект.ФорматФайла = "","xlsx",Объект.ФорматФайла);
КонецПроцедуры

//Расписание
&НаСервереБезКонтекста
Функция ПолучитьРасписаниеРегламентногоЗадания(СтрокаВнутр)
	Если СтрокаВнутр = "" Тогда
		Возврат Неопределено
	КонецЕсли;
	Возврат ЗначениеИзСтрокиВнутр(СтрокаВнутр)
КонецФункции	

&НаСервере
Процедура ВыполнитьПослеЗакрытияДРРЗ(Расписание, ДополнительныеПараметры)Экспорт
	 Если Расписание =Неопределено Тогда
	 
	 	Возврат	
	 
	 КонецЕсли;
	Объект.Расписание =  ЗначениеВСтрокуВнутр(Расписание);
	Объект.РасписаниеПредставление = Строка(Расписание);
	
КонецПроцедуры // ()

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РРЗ = ПолучитьРасписаниеРегламентногоЗадания(Объект.Расписание);
	Если РРЗ = Неопределено Тогда
	    РРЗ = Новый РасписаниеРегламентногоЗадания;	
	КонецЕсли;
	ДРРЗ = Новый ДиалогРасписанияРегламентногоЗадания(РРЗ);
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияДРРЗ", ЭтотОбъект);
	ДРРЗ.Показать(Оп); 

КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	Объект.Расписание = "";
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПолучательПриИзменении(Элемент)
	ТД = Элементы.Получатели.ТекущиеДанные;
	ТД.Email = ПолучитьEmail(ТД.Получатель);
КонецПроцедуры

&НаСервере
Функция ПолучитьEmail(Получатель)
	Возврат СокрЛП(Получатель.Почта);
КонецФункции
